soap-request-hwait.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wiz="http://wizard/">
   <soap:Header/>
   <soap:Body>
      <wiz:sayHello>
         <!--Optional:-->
         <name>Fevzi Korkutata</name>
         <!--Optional:-->
         <waitSecond>0</waitSecond>
      </wiz:sayHello>
   </soap:Body>
</soap:Envelope>
